In [1]:

# 1. Create a friend_names.csv file delimiter is comma(,)  (atleast 10 names, columns are FriendName,Quality)
import pandas as pd

df=pd.read_csv(r"C:\jaya sri\Assignments\8\friend_names,Quality.txt")
df

  friend_names      Quality
0      Mounika  intelligent
1     Santhosh  intelligent
2     nasheena        brave
3       swathi         good
4        durga  intelligent
5       Swapna       clever

In [2]:
df.head()

  friend_names      Quality
0      Mounika  intelligent
1     Santhosh  intelligent
2     nasheena        brave
3       swathi         good
4        durga  intelligent

In [3]:
df.tail()

  friend_names      Quality
1     Santhosh  intelligent
2     nasheena        brave
3       swathi         good
4        durga  intelligent
5       Swapna       clever

In [4]:
df.columns

Index(['friend_names', 'Quality'], dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   friend_names  6 non-null      object
 1   Quality       6 non-null      object
dtypes: object(2)
memory usage: 228.0+ bytes

In [6]:
df.dtypes

friend_names    object
Quality         object
dtype: object

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
df.shape

(6, 2)

In [10]:
# 2. Create a family_members.txt file delimiter is star (*), (atleast 10 names, columns are FamilyMemberName*Relation)
df1=pd.read_csv(r"C:\jaya sri\Assignments\8\familymembernamerelation.txt",sep="*")
df1

  familymembername relation
0     janardhnarao   father
1          lakshmi   mother
2          mounika   sister
3           prasad  brother

In [11]:
df1.head()

  familymembername relation
0     janardhnarao   father
1          lakshmi   mother
2          mounika   sister
3           prasad  brother

In [12]:
df1.tail()

  familymembername relation
0     janardhnarao   father
1          lakshmi   mother
2          mounika   sister
3           prasad  brother

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   familymembername  4 non-null      object
 1   relation          4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [14]:
df1.columns

Index(['familymembername', 'relation'], dtype='object')

In [15]:
df1.shape

(4, 2)

In [16]:
type(df1)

pandas.core.frame.DataFrame

In [17]:
df1.dtypes

familymembername    object
relation            object
dtype: object

In [18]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
# 3. Create a Vegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are VegFoodName*Taste)
df3=pd.read_csv(r"C:\jaya sri\Assignments\8\veg food.txt",sep="|")
df3

     vegfoodname  taste
0         potato  sweet
1  ladiesfingers    hot
2         tomato   nice
3       cocumber    bad

In [20]:
df3.head()

     vegfoodname  taste
0         potato  sweet
1  ladiesfingers    hot
2         tomato   nice
3       cocumber    bad

In [21]:
df3.tail()

     vegfoodname  taste
0         potato  sweet
1  ladiesfingers    hot
2         tomato   nice
3       cocumber    bad

In [22]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   vegfoodname  4 non-null      object
 1   taste        4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [23]:
df3.columns

Index(['vegfoodname', 'taste'], dtype='object')

In [24]:
df3.shape

(4, 2)

In [25]:
type(df3)

pandas.core.frame.DataFrame

In [26]:
df3.dtypes

vegfoodname    object
taste          object
dtype: object

In [27]:
df3.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
# 4. Create a NonVegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are NonVegFoodName*Taste)
df4=pd.read_csv(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\NonVegFoodNameTaste.txt",sep="|")
df4

  NonVegFoodName      Taste
0  chikenbiryani      spicy
1  muttonbiryani  tasteless
2    fishbiryani        hot

In [29]:
df4.head()

  NonVegFoodName      Taste
0  chikenbiryani      spicy
1  muttonbiryani  tasteless
2    fishbiryani        hot

In [30]:
df4.tail()

  NonVegFoodName      Taste
0  chikenbiryani      spicy
1  muttonbiryani  tasteless
2    fishbiryani        hot

In [31]:
df4.columns

Index(['NonVegFoodName', 'Taste'], dtype='object')

In [32]:
df4.shape

(3, 2)

In [33]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   NonVegFoodName  3 non-null      object
 1   Taste           3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [34]:
df4.index

RangeIndex(start=0, stop=3, step=1)

In [35]:
df4.dtypes

NonVegFoodName    object
Taste             object
dtype: object

In [36]:
type(df4)

pandas.core.frame.DataFrame

In [37]:
# 5. Create a month_names.txt file delimiter is and (&), (atleast 12 names, columns are MonthName*Season)
df5=pd.read_csv(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\MonthNameandSeason.txt",sep="*")
df5

   MonthName@Season
0    January@winter
1    Febuary@winter
2      March@winter
3      April@Summer
4        May@Summer
5       June@summer
6       July@Summer
7      August@Rainy
8   September@Rainy
9     October@Rainy
10   November@Rainy
11  December@Winter

In [38]:
df5.head()

  MonthName@Season
0   January@winter
1   Febuary@winter
2     March@winter
3     April@Summer
4       May@Summer

In [39]:
df5.tail()

   MonthName@Season
7      August@Rainy
8   September@Rainy
9     October@Rainy
10   November@Rainy
11  December@Winter

In [40]:
df5.columns

Index(['MonthName@Season'], dtype='object')

In [41]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 1 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   MonthName@Season  12 non-null     object
dtypes: object(1)
memory usage: 228.0+ bytes

In [42]:
df5.index

RangeIndex(start=0, stop=12, step=1)

In [43]:
df5.shape

(12, 1)

In [44]:
df5.dtypes

MonthName@Season    object
dtype: object

In [45]:
type(df5)

pandas.core.frame.DataFrame

In [46]:
# 6. Create a colours_names.txt file delimiter is cap (^), (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)
df6=pd.read_csv(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\colournames.txt",sep="^")
df6

  colourName_in_English colourName_in_Hindi colourName_in_Telugu
0                   red                laal               Yerupu
1                 black               kaala               nalupu
2                 white              safedh               telupu

In [47]:
df6.head()

  colourName_in_English colourName_in_Hindi colourName_in_Telugu
0                   red                laal               Yerupu
1                 black               kaala               nalupu
2                 white              safedh               telupu

In [48]:
df6.tail()

  colourName_in_English colourName_in_Hindi colourName_in_Telugu
0                   red                laal               Yerupu
1                 black               kaala               nalupu
2                 white              safedh               telupu

In [49]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   colourName_in_English  3 non-null      object
 1   colourName_in_Hindi    3 non-null      object
 2   colourName_in_Telugu   3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [50]:
df6.columns

Index(['colourName_in_English', 'colourName_in_Hindi', 'colourName_in_Telugu'], dtype='object')

In [51]:
df6.dtypes

colourName_in_English    object
colourName_in_Hindi      object
colourName_in_Telugu     object
dtype: object

In [52]:
type(df6)

pandas.core.frame.DataFrame

In [53]:
df6.shape

(3, 3)

In [54]:
df6.index

RangeIndex(start=0, stop=3, step=1)

In [55]:
# 7. Create a friend_names.xls file  (atleast 10 names, columns are FriendName,Quality)
df_friends=pd.read_excel(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\friends_1.xlsx")
df_friends

  friendname      Quality
0  santhosh   intelligent
1     swathi       clever
2   nasheena         good
3      durga         calm

In [56]:
df_friends.head()

  friendname      Quality
0  santhosh   intelligent
1     swathi       clever
2   nasheena         good
3      durga         calm

In [57]:
df_friends.tail()

  friendname      Quality
0  santhosh   intelligent
1     swathi       clever
2   nasheena         good
3      durga         calm

In [58]:
df_friends.columns

Index(['friendname', 'Quality'], dtype='object')

In [59]:
df_friends.shape

(4, 2)

In [60]:
df_friends.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
df_friends.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   friendname  4 non-null      object
 1   Quality     4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [62]:
df_friends.dtypes

friendname    object
Quality       object
dtype: object

In [63]:
type(df_friends)

pandas.core.frame.DataFrame

In [64]:
# 8. Create a family_members.xls file  (atleast 10 names, columns are FamilyMemberName*Relation)
df_family=pd.read_excel(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\family_1.xlsx")
df_family

  familymembername relation
0     janardhnarao   father
1          lakshmi   mother
2          mounika   sister
3           prasad  brother
4       rajasekhar  brother

In [65]:
df_family.head()

  familymembername relation
0     janardhnarao   father
1          lakshmi   mother
2          mounika   sister
3           prasad  brother
4       rajasekhar  brother

In [66]:
df_family.tail()

  familymembername relation
0     janardhnarao   father
1          lakshmi   mother
2          mounika   sister
3           prasad  brother
4       rajasekhar  brother

In [67]:
df_family.shape

(5, 2)

In [68]:
df_family.index

RangeIndex(start=0, stop=5, step=1)

In [69]:
df_family.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   familymembername  5 non-null      object
 1   relation          5 non-null      object
dtypes: object(2)
memory usage: 212.0+ bytes

In [70]:
df_family.dtypes

familymembername    object
relation            object
dtype: object

In [71]:
type(df_family)

pandas.core.frame.DataFrame

In [72]:
df_family.columns

Index(['familymembername', 'relation'], dtype='object')

In [73]:
# 9. Create a Vegfood_items.xlsx file  (atleast 10 names, columns are VegFoodName*Taste)
df_veg=pd.read_excel(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\vegfoodtaste.xlsx")
df_veg

           veg food   taste
0            panner     hot
1          babycorn   sweet
2       aloo samosa  crispy
3  mushroom biryani   spicy

In [74]:
df_veg.head()

           veg food   taste
0            panner     hot
1          babycorn   sweet
2       aloo samosa  crispy
3  mushroom biryani   spicy

In [75]:
df_veg.tail()

           veg food   taste
0            panner     hot
1          babycorn   sweet
2       aloo samosa  crispy
3  mushroom biryani   spicy

In [76]:
df_veg.columns

Index(['veg food', 'taste'], dtype='object')

In [77]:
df_veg.shape

(4, 2)

In [78]:
df_veg.index

RangeIndex(start=0, stop=4, step=1)

In [79]:
df_veg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   veg food  4 non-null      object
 1   taste     4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [80]:
df_veg.dtypes

veg food    object
taste       object
dtype: object

In [81]:
type(df_veg)

pandas.core.frame.DataFrame

In [82]:
# 10. Create a NonVegfood_items.xlsx file  (atleast 10 names, columns are NonVegFoodName*Taste)
df_nonveg=pd.read_excel(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\nonvegtaste.xlsx")
df_nonveg

    nonveg  taste
0  chicken    hot
1   mutton  salty
2     fish   good
3   prawns  spicy

In [83]:
df_nonveg.head()

    nonveg  taste
0  chicken    hot
1   mutton  salty
2     fish   good
3   prawns  spicy

In [84]:
df_nonveg.tail()

    nonveg  taste
0  chicken    hot
1   mutton  salty
2     fish   good
3   prawns  spicy

In [85]:
df_nonveg.columns

Index(['nonveg', 'taste'], dtype='object')

In [86]:
df_nonveg.shape

(4, 2)

In [87]:
df_nonveg.index

RangeIndex(start=0, stop=4, step=1)

In [88]:
df_nonveg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nonveg  4 non-null      object
 1   taste   4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [89]:
df_nonveg.dtypes

nonveg    object
taste     object
dtype: object

In [90]:
type(df_nonveg)

pandas.core.frame.DataFrame

In [91]:
# 11. Create a month_names.xlsx file (atleast 12 names, columns are MonthName*Season)
df_month=pd.read_excel(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\MonthsandSeason.xlsx")
df_month

    MonthName  Season
0     January  Winter
1     Febuary  Winter
2       March  Winter
3       April  Summer
4         May  Summer
5        June  Summer
6        July  Summer
7      August   Rainy
8   September   Rainy
9     October   Rainy
10   November   Rainy
11   December  Winter

In [92]:
df_month.head()

  MonthName  Season
0   January  Winter
1   Febuary  Winter
2     March  Winter
3     April  Summer
4       May  Summer

In [93]:
df_month.tail()

    MonthName  Season
7      August   Rainy
8   September   Rainy
9     October   Rainy
10   November   Rainy
11   December  Winter

In [94]:
df_month.columns

Index(['MonthName', 'Season'], dtype='object')

In [95]:
df_month.index

RangeIndex(start=0, stop=12, step=1)

In [96]:
df_month.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   MonthName  12 non-null     object
 1   Season     12 non-null     object
dtypes: object(2)
memory usage: 324.0+ bytes

In [97]:
df_month.dtypes

MonthName    object
Season       object
dtype: object

In [98]:
type(df_month)

pandas.core.frame.DataFrame

In [99]:
df_month.shape

(12, 2)

In [100]:
# 12. Create a colours_names.xlsx file  (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)
df_colours=pd.read_excel(r"C:\jaya sri\Assignments\Jayasri\Pandas_assign8\Colournames.xlsx")
df_colours

  ColourNamesinTelugu ColourNamesinHindi ColourNamesinEnglish
0             Thelupu             safedh                White
1              nalupu              kaala                Black
2               pacha               hari                Green
3              yerupu               laal                  Red
4              pasupu              peela               Yellow

In [101]:
df_colours.head()

  ColourNamesinTelugu ColourNamesinHindi ColourNamesinEnglish
0             Thelupu             safedh                White
1              nalupu              kaala                Black
2               pacha               hari                Green
3              yerupu               laal                  Red
4              pasupu              peela               Yellow

In [102]:
df_colours.tail()

  ColourNamesinTelugu ColourNamesinHindi ColourNamesinEnglish
0             Thelupu             safedh                White
1              nalupu              kaala                Black
2               pacha               hari                Green
3              yerupu               laal                  Red
4              pasupu              peela               Yellow

In [103]:
df_colours.columns

Index(['ColourNamesinTelugu', 'ColourNamesinHindi', 'ColourNamesinEnglish'], dtype='object')

In [104]:
df_colours.shape

(5, 3)

In [105]:
df_colours.index

RangeIndex(start=0, stop=5, step=1)

In [106]:
df_colours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   ColourNamesinTelugu   5 non-null      object
 1   ColourNamesinHindi    5 non-null      object
 2   ColourNamesinEnglish  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [107]:
type(df_colours)

pandas.core.frame.DataFrame

In [108]:
df_colours.dtypes

ColourNamesinTelugu     object
ColourNamesinHindi      object
ColourNamesinEnglish    object
dtype: object